TOOL:	xrun	19.09-s003: Started on Oct 07, 2021 at 15:57:33 CEST
xrun
	-F tb.f
		apple.sv
		apple_tb.sv
	-v93
	+nowarnDSEM2009
	+nowarnDSEMEL
	+nowarnCGDEFN
	-xmlibdirname INCA_libs_gui
	+access+r
	+gui
	+overwrite
	-nocopyright
	-covtest lab01
	-l xrun_gui.log
	-s
INCLUDE $PDK_DIR/cds/cds.lib
|
xrun: *W,DLCVAR (/home/student/nmalota/cds.lib,1): cds.lib Invalid environment variable ''.
INCLUDE $PDK_DIR/cds/cds.lib
|
xrun: *W,DLCVAR (/home/student/nmalota/cds.lib,1): cds.lib Invalid environment variable ''.
INCLUDE $PDK_DIR/cds/cds.lib
|
xrun: *W,DLCVAR (/home/student/nmalota/cds.lib,1): cds.lib Invalid environment variable ''.
INCLUDE $PDK_DIR/cds/cds.lib
|
xrun: *W,DLCVAR (/home/student/nmalota/cds.lib,1): cds.lib Invalid environment variable ''.
INCLUDE $PDK_DIR/cds/cds.lib
|
xrun: *W,DLCVAR (/home/student/nmalota/cds.lib,1): cds.lib Invalid environment variable ''.
INCLUDE $PDK_DIR/cds/cds.lib
|
xrun: *W,DLCVAR (/home/student/nmalota/cds.lib,1): cds.lib Invalid environment variable ''.
INCLUDE $PDK_DIR/cds/cds.lib
|
xmsim: *W,DLCVAR (/home/student/nmalota/cds.lib,1): cds.lib Invalid environment variable ''.
xcelium> 
xcelium> source /cad/XCELIUM1909/tools/xcelium/files/xmsimrc
xcelium> 
-------------------------------------
Relinquished control to SimVision...
# Restoring simulation environment...
xcelium> input -quiet .reinvoke.sim
xcelium> file delete .reinvoke.sim
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm apple_tb.a apple_tb.b apple_tb.clk apple_tb.q
Created probe 1
xcelium> run
Simulation complete via $finish(1) at time 40 NS + 0
./apple_tb.sv:22 		$finish();
xcelium> ^C
xcelium> exit

coverage setup:
  workdir  :  ./cov_work
  scope    :  scope
  testname :  lab01
TOOL:	xrun	19.09-s003: Exiting on Oct 07, 2021 at 15:58:16 CEST  (total: 00:00:43)
